#include <iostream>
using namespace std;
#include<string>	

/*
===================================================================================
整型
	short			短整型			2字节
	int				整型				4字节
	long			长整型			window4字节、linux4字节（32位）或8字节（64位）
	longlong		长长整型			8字节
===================================================================================
sizeof
	利用sizeof()关键字可以统计数据类型所占内存的大小（字节为单位）
	sizeof(数据类型 / 变量)
===================================================================================
浮点型
	float		单精度			4字节		7位有效数字				float f = 0.01f
	double		双精度			8字节		15~16位有效数字			double d = 0.01
编辑器默认小数为double，在数字后加上f指定为float类型
默认情况下，输出一个小数，会显示6位有效数字
科学计数法
	3e2代表300，3e-2代表0.03
===================================================================================
字符型 char ch = ‘a’;
单个字符需要用单引号，双引号是错误的
只占用一个字节内存
字符型变量对应存储单元存放的是ASCII编码
===================================================================================
转义字符（在字符串，也就是双引号中使用）
	\a		警报
	\b		退格（BS）
	\f		换页（FF）
*	\n		换行（LF）
	\r		回车（CR）
*	\t		水平制表（HT），整齐的输出数据
	\v		垂直制表（VT）
*	\\		代表一个反斜杠字符
	\'		代表一个单引号字符
	\"		代表一个双引号字符
	\?		代表一个问好
	\0		代表数字0
===================================================================================
字符串（均需要使用双引号）
	C风格字符串		char st[] = "字符串值“；		字符数组
	C++风格字符串		string str = ”字符串值“;		字符串类			需要头文件#include<string>
===================================================================================
bool类型：非0数字都代表真
	true		本质是1		1字节
	false		本质是0		1字节
===================================================================================
数据输入cin >>
===================================================================================
*/

int main() {

	cout << "short:" << sizeof(short) << endl;
	cout << "int:" << sizeof(int) << endl;
	cout << "long:" << sizeof(long) << endl;
	cout << "long long:" << sizeof(long long) << endl;

	cout << "5/3 = " << 5.0/3.0 << endl;

	float f = 3.14f;
	cout << "float:" << sizeof(float) << endl;

	char ch = 'c';
	cout << "字符c对应的ASCII码" << int(ch) << endl;

	bool x = true;
	cout << "true:" << x << endl;
	cout << "false:" << false << endl;

	int a = 0;
	cout << "请给整型变量a赋值" << endl;
	cin >> a;
	cout << "a = " << a << endl;

	return 0;
}