#include <iostream>
using namespace std;

/*
========================================================================================
三种程序结构：顺序结构、选择结构、循环结构
========================================================================================
if语句
单行if：if(){}
多行if：if(){}	else{}
多条件if：if(){}	else if(){}	else if(){}......else{}
嵌套if语句
========================================================================================
三目运算符
a ？ b : c
如果a为真，则执行b并返回b的结果；反之如果a为假，则执行c并返回c的结果
========================================================================================
switch语句
switch(x){
	case a: 执行语句; break;
	case b: 执行语句; break;
	case c: 执行语句; break;
	case d: 执行语句; break;
	case e: 执行语句; break;
	case f: 执行语句; break;
	default: 执行语句; break;
}
========================================================================================
while循环语句
while(循环条件){循环语句}
========================================================================================
do...while循环语句
与while区别就是它会先执行一次循环语句
do{循环语句}while(循环条件)
========================================================================================
for循环语句
for(起始表达式;条件表达式;末尾循环体)	{循环语句;}
========================================================================================
嵌套循环
========================================================================================
跳转语句
break：跳出选择结构或者循环结构
continue：在循环语句中，跳过本次循环中尚未执行的部分，继续执行下一次循环
goto：无条件跳转到标记位置

*/

int main() {

	// if语句练习：三只小猪ABC，请分别输入三只小猪体重，并判断哪只小猪最重

	// while循环练习：系统随机生成一个1到100之间的数字，玩家猜测，猜错则提示玩家数字过大还是过小，直到猜对时恭喜玩家并退出游戏

	// do...while练习：求出所有三位数的水仙花数（各位上的数字三次幂之和等于它自己）

	// for练习：从1数到100，如果数字个位或十位含有7或者该数字是7的倍数，打印敲桌子，其他数字直接输出

	//嵌套循环练习：实现九九乘法表

	return 0;
}